{
  "blogs": [
    {
      "id": 1,
      "thumbnail": "https://etzq49yfnmd.exactdn.com/wp-content/uploads/2022/03/lenny-kuhne-jHZ70nRk7Ns-unsplash.jpg",
      "title": "5G Is 200X Faster and Will Unlock Everything. Here’s Who’s Ready.",
      "content": "Just like 4G brought us Uber and the appification-of-everything, 5G will rewrite concepts of speed, capacity and entire connected experiences, including applications of the internet of things and virtual and augmented reality. With 5G, those trends will accelerate, and we’ll see mainstream applications of virtual and augmented reality and new digital business models we can’t even begin to fully imagine yet. But we can start to get a picture of what the future holds with 5G, especially in what it means for businesses.<br><br>So what are the key features of the new 5G technology and what kind of new applications will they unlock? How much more mobile data will be generated compared to today? And which industries and countries are most likely to adopt 5G as part of their core operations and which are not?<br><br>There are four major updates coming with 5G: faster network speeds, lower latency, better device connectivity, and a new feature called “network splicing.”<br><br>Network speed is straightforward to understand and the aspect of 5G that gets the most attention. In a nutshell, everything on 5G is about to get a lot faster.<br><br>You might think things are pretty fast over the current 4G network, but speeds are estimated to be 200 times higher on 5G. In practical terms this means that over a 5G network you may be able to download a whole movie in 17 seconds over 5G, compared to 6 minutes over 4G.<br><br>Download speeds aren’t the only component of network speed to consider; latency is also much improved in 5G. Latency, the time it takes for an application to respond to a command, is reduced by 20x in 5G.<br><br>Low latency is critical for enabling all sorts of new applications that require real-time access to data and analysis. For example, a self-driving car can’t really rely on current networks for realtime information because the response time is too slow. Under 5G, data made available to these kinds of cars nearer to the time that’s necessary for decision making.Today, only about 100,000 devices can be supported on the 4G network in square kilometers. On a 5G network there can be up to 10x as many devices, which means that up to a million devices can be connected.. To anyone who has ever attended a sports event or concert where cell phone service has choked to a halt, the inability to connect to the network in large crowds may become a thing of the past with 5G.<br><br>Increased device density can enable a whole new set of applications that might seem like science fiction today. Imagine tens or hundreds of thousands of nano-drones flying through an area taking sensor measurements or video.<br><br>Lastly, a new feature of 5G compared to prior networks is known as network slicing. Network slicing allows developers to customize networks for particular use cases via an API. Rather than a one-size-fits-all network, developers can create network environments best suited for the applications at hand, whether it’s telesurgery or smart metering.",
      "date": "01-07-2020"
    },
    {
      "id": 2,
      "thumbnail": "https://etzq49yfnmd.exactdn.com/wp-content/uploads/2022/03/kerry-rawlinson-SzWSiYzBQZE-unsplash.jpg",
      "title": "People Left Cities for Rural Zoom Towns. How Does That Impact Wildfire Risk?",
      "content": "As the pandemic waxes and wanes and we look back on the last 18 months, it’s clear that different types of workers experienced differential economic impacts. On one hand, there are workers who need to be in a location to do their job. Many members of the workforce, including restaurant staff, hotel employees, and those in the events industry saw their financial livelihoods devastated as the pandemic shut down parts of the economy.<br><br>On the other hand, we also saw the boom of “Zoom workers”—or knowledge workers who can conduct their work online. These workers typically work from anywhere. For these workers, the pandemic enabled them to move out of the city and work in more rural locations with natural beauty.<br><br>As such, the pandemic has given birth to a massive real estate boom in these so-called “Zoom towns” where knowledge workers relocated during the pandemic. These picturesque locations, particularly in the West, have seen a spike in real estate prices.<br><br>But there is tremendous risk associated with these growing Zoom towns in rural areas —almost all of them are in high wildfire risk areas. Living in a cabin in the woods seems idyllic until a spark of lightning ignites the forest and endangers your home.<br><br>In this analysis, we examine the wildfire risk and property values of popular Zoom towns in the Western U.S. At CAPE Analytics, we use artificial intelligence to analyze vast quantities of geospatial imagery to help insurers and other companies better understand properties and property risk. In this analysis, we look at U.S. Forest Service wildfire risk data, paired with Zillow home price estimates from the Zillow Home Value Index.<br><br>We found that the Zoom town with the highest fire risk in our sample is Mariposa, CA, a picturesque town near Yosemite, followed by Springdale, UT, and Lake Arrowhead, CA. Meanwhile, the most expensive Zoom towns in our sample were Aspen, CO, and Carmel-by-the-Sea, CA. The Zoom towns with the fastest price appreciation were Glen Ellen, CA, Truckee, CA, and Big Bear, CA, with annual price appreciation exceeding 25% in each location.<br><br>In general, our analysis finds that Zoom towns with lower home prices tend to carry higher wildfire risk. However, these same areas, which carry high fire risk, are also experiencing the highest appreciation in property values, as remote workers drive up demand. For those who deal with risk, such as the insurance industry, this can be a worrisome trend. Not only are more people moving to these higher-risk areas, but the property values (and subsequent potential losses) are growing at unprecedented rates.<br><br>Before diving into the results, let’s spend a moment on the data sources and methodology. The U.S. Forest Service provides wildfire risk assessment for much of the United States on a 0 to 5 score ranking system (0 being no risk, 5 being very high risk). We looked at the fire risk scores in cities and towns mentioned in news articles about pandemic relocation trends. This data was then paired with Zillow’s typical single-family home value estimates according to the Zillow Home Value Index (ZHVI) as of April 30th, 2021.<br><br>By a significant margin, Mariposa, CA, has the highest average wildfire risk at 3.8. Coming in second place is Springdale, UT, a town near Zion National Park. Lake Arrowhead, a Southern California vacation destination, and Glen Ellen, CA, a town in the middle of Sonoma wine country, round out the top four highest risk areas.<br><br>The lowest wildfire risk areas among Zoom towns in the Western United States are Butte, MT, followed by the arid locations of Palm Springs, CA, and La Quinta, CA. It should be noted that even in areas like Napa, CA, which ranks as low as 0.6 fire risk, this score is skewed by the more densely populated portions of each city. In the more rural surrounding areas of each town, the fire risk can be extremely high.<br><br>Next, we wanted to quantify the typical home price in each of these Zoom towns. The following chart ranks homes by typical value, according to Zillow, and compares those values to each town’s wildfire risk.<br><br>Aspen, Vail, Sun Valley, and Park City, all small Western ski towns, make up four out of the five most expensive places. In second place is Carmel-by-the-Sea in California. All of these top five areas have relatively low wildfire risk on average. The least expensive Zoom towns in our sample are Butte, MT, Mariposa, CA and MT, Taos, NM. In Butte and Taos, at least, the wildfire risk is lower than the typical city in this study.<br><br>How do home prices correlate with fire risk in these idyllic rural locations? The following chart shows the Zillow home values segmented by wildfire risk bucket.<br><br>In general, the more wildfire risk in the area, the lower the home prices. Homeowners insurance is higher in fire-prone areas (or impossible to obtain), which may also help drive down home prices. Another possible explanation is that homes in particularly high-risk areas tend to be more remote, closer to wildland, and further away from amenities that drive up home prices.<br><br>Finally, let’s turn our attention to where home prices are rising the fastest over the last year as some people work from home in more rural areas. Below is the chart of the Zoom towns with the largest 1-year price appreciation.<br><br>Glen Ellen, a town in Sonoma wine country, has the highest appreciation rate over this last year, with homes increasing 28.8% in just one year. Truckee, the ski town on the California side of the Lake Tahoe area, has had the second-highest price growth in the last year, with homes selling for 27.7% more than the year prior. As Bay Area workers flee to Lake Tahoe, Truckee is a more affordable homeownership option than being closer to the lake in Tahoe City. Big Bear Lake in California also saw price appreciation greater than 25% in one year.<br><br>Unfortunately, we have seen a substantial increase in demand for homes that happen to be in high fire risk zones. The highest price appreciation has been in areas with a high fire risk score of 2-3, which includes many areas that have had devastating wildfires in recent years, followed by areas with moderate fire risk of 1-2.<br><br>The COVID migratory pattern of people leaving cities has led to an influx of homebuyers in these higher wildfire risk areas. For people fortunate enough to be economically unscathed by the pandemic, working remotely has opened living options. As a result, many are relocating to mountain towns, wine country, or near a picturesque national park. As more demand for rural living leads to more housing and higher home value in those areas, the risk and possible total destructive value of a wildfire increases in turn.<br><br>New homeowners in these areas should be aware of this heightened risk and take mitigation measures, such as maintaining a minimum, 10-foot defensible space perimeter between the home and any vegetation. A recent Cape Analytics analysis, for example, shows that clearing vegetation from 10 feet around a home reduces the risk of damage from a wildfire by 80% or more, in very high-risk areas.<br><br>As climate change and associated wildfire risk worsen throughout the Western U.S., it’s paramount for government officials, insurance companies, and homeowners to understand the changing risk landscape and the possible negative impacts on people and property.",
      "date": "07-27-2021"
    },
    {
      "id": 3,
      "thumbnail": "https://etzq49yfnmd.exactdn.com/wp-content/uploads/2022/03/christian-bowen-Cc10IJDoj78-unsplash.jpg",
      "title": "Senior Citizens Face Mental and Financial Stress, Especially Women",
      "content": "While this has been a challenging year for many, for senior citizens the pandemic has been particularly stressful. Social isolation, high mortality rates from COVID-19, and financial devastation from the pandemic have landed hard on seniors around the world.<br><br>In this analysis, we decided to survey our members at Seniorly on their mental and financial well being. These individuals are based in the United States and are using our services to find a senior living community.<br><br>We found that most seniors in our survey considered themselves well supported by their friends and community and were generally optimistic about their mental health and finances. On average, seniors in the United States have been the picture of resilience as we emerge from the pandemic.<br><br>However, on nearly every metric, female seniors reported themselves to be struggling compared to their male counterparts. From finances to mental health, many more women than men note that they are dissatisfied, and stressed about finances and support. When it comes to enjoying later life, there appears to be a gender gap in connectedness, and women are more likely to be stressed during their golden years.<br><br><b>Methodology</b><br><br>Before diving in, let’s spend a moment reviewing the data and methodology. Between January 2021 and April 2021 we fielded a monthly survey of Seniorly members (people searching for assisted living), with approximately 500 responses per month. These questions, by and large, focused on how U.S. seniors are feeling about their well-being and quality of life. Each chart below shows the longitudinal trends in responses over the last four months, followed by an analysis of how responses split by gender for the most recent month (April).<br><br><b>Mental Health</b><br><br>To begin, let’s review the overall mental health snapshot of Seniorly users. The following chart shows the response to the question “Do you feel mentally healthy?” during the first four months of 2021. Despite a very trying year, 84% of seniors reported that they feel mentally healthy, trending up slightly from the prior month. Just 8.0% of respondents reported not feeling mentally healthy, the lowest since we started the survey.<br><br>However, digging slightly deeper into the data on those who do not feel mentally healthy, a more nuanced picture emerges. Women are more than twice as likely as men to report they do not feel mentally healthy. 9.7% of all women surveyed reported not feeling mentally healthy, compared to just 4.5% of men. This data point is the first of a pattern of women reporting more stress, financial worry, and mental distress than men.<br><br><b>Emotions</b><br><br>As the pandemic has waned this year in the United States, how have the emotions of senior citizens changed over the last four months? The following chart shows the percentage of respondents who reported each emotion as being their predominant emotion of the last week. Notably, since January the Contented emotion has surged from 29.1% of respondents to 38.0%. Angry is also down substantially from 5.3% to 1.9% of respondents, and Worried is down substantially as well. Other emotions like Excited, Happy, Lonely, Restless, and Sad have remained relatively stable. While the most common feeling among seniors in our survey is Contented, how prevalent is this feeling in men versus women? As of April 2021, men are 35% more likely to report being Contented than women. To wrap up this section, let’s take a look at what seniors self identify as the biggest stressors in their lives.<br><br><b>Support</b><br><br>Shifting gears slightly from mental health, let’s look at community support received by seniors. How many seniors feel they have an adequate support system and is there a persistent gender gap as we saw with mental health? Most recently, 61.4% of seniors reported that they had the perfect amount of support, while only 4.1% say they do not receive any support from anyone. Practically no one says they would like less support. Among women, 38.2% would like more support, while only 24.9% of men respond they would like more support. Just as more women report they struggle with their mental health, more women are asking for more support during their senior years. What kind of support are seniors receiving from their communities? The following chart shows Seniorly’s users assessments of their connection with their communities. Only 22.8% percent of respondents feel strongly connected to their communities, indicating there is strong room for improvement in terms of community building to better support seniors. 53.0% of respondents do feel mildly connected to their communities, however. <br><br><b>Finance</b><br><br>Finally, let’s examine how seniors view their personal financial situations and get their thoughts on affording the costs of elder-care. The following chart shows seniors’ assessments of how their financial positions have changed during this year. April saw a large spike in the percentage of seniors who saw an improved financial position, rising from 12.9% to 18.1% of respondents. The vast majority of seniors (69.2%) reported their finances stayed the same, a number that’s held stable. There was also a sizable decrease in the number of Seniorly members who reported a worsened financial position. Nearly twice as many men versus women said that their financial position improved. As the stock market has roared back and investment accounts have been replenished, these market gains may have been distributed unevenly by gender.<br><br><b>Conclusion</b><br><br>The latest analysis from Seniorly paints both an encouraging and discouraging picture of seniors. On one hand, most senior citizens consider themselves mentally healthy, contented, well supported by their community, and in a stable financial position. On the other hand, a sizable minority report their concern over their own mental health, community support and finances. According to this analysis, women are much more likely than men to be in this stressed and concerned cohort of seniors. A number of scientific studies have posited that elderly women are more susceptible to depression and that women score lower than men on most indicators of well being and mental health due to higher levels of poverty and from taking on more household labor and stress. The stress of retirement, old age and finding a community in which to live appears to be landing with greater force upon women.",
      "date": "06-17-2021"
    },
    {
      "id": 4,
      "thumbnail": "https://etzq49yfnmd.exactdn.com/wp-content/uploads/2022/03/markus-spiske-wL7pwimB78Q-unsplash.jpg",
      "title": "The Companies Where Employees Most Often Get Payday Loans",
      "content": "Payday loans are used by people who need money fast, who often have no other way of borrowing money to cover an unexpected expense. The benefit of these kinds of loans is they enable you to meet your immediate financial obligations. The risk, however, is you are taking on debt and incurring future obligations that require future income to fulfill.<br><br>In this article, we’ll analyze the employment status of people who take on payday loans. Do they have jobs that will enable them to pay back the loans in a timely fashion or are they cornering themselves into an amount of debt without the income to ever repay the loans?<br><br>At LendUp, we provide loans to people to cover unexpected expenses or when they need the money fast. Because of our years of underwriting loans and working with our customers, we know a lot about the financial background of our loan recipients.<br><br>In this analysis, we’ll review the data on the employment characteristics of Americans who turn to payday loans. How many people who turn to payday loans have jobs? Are they employed full-time and where do they work?<br><br>We found that the overwhelming majority of payday loan recipients (81.2%) have full time jobs. When you add the number of recipients that work part-time or are already retired, that accounts for well over 90% of recipients. Most commonly, payday loan recipients work in sales, office, and healthcare support. The most common employer of LendUp users who seek a payday loan is Walmart, followed by Kaiser, Target and Home Depot.<br><br>As part of our loan application process, we ask borrowers to state their employment status and current employer. For this analysis, we reviewed loans from 2017 to 2020 to see the most common employment status, industries and employers. The data is from states where LendUp currently operates (WI, MO, TX, LA, MS, TN, CA) plus additional states in which we previously made loans (IL, KS, LA, MN, OK, OR, WA, WY). When considering the most common employers of payday loan recipients, this data set will reflect the largest employers in our largest markets, like California.<br><br>To begin, let’s look at the employment status of people who get payday loans via LendUp. What percentage of loan recipients have full time employment versus some alternative?<br><br>81.2% of all payday loan recipients on LendUp have full-time employment, meaning that they should have income coming to pay back their debts. More commonly, people use payday loans to cover the timing mismatch of having an expense coming in before the paycheck arrives to cover it. If you add those that are part-time employed, retired, or self-employed to those with full-time employment, you account for 96.1% of payday loan recipients. Just 1.2% of payday loan recipients are classified as unemployed.<br><br>The most common industry for needing a payday loan is sales related. This could include retail workers or sales people working on a commission with an erratic pay schedule. The second most common industry is people working in office and administrative. Of note, the third most common category is healthcare related.<br><br>Walmart, the largest employer in the United States, is the number employer of payday loan recipients through LendUp. Twice as many payday loan recipients work at Walmart compared to the second most common company, Kaiser. The list is dominated by retail companies, but also healthcare, education, and government.<br><br>In this analysis, we’ve shown that the vast majority of payday loan recipients are employed full time. Despite earning a regular income, expenses come up that people do not have the bank account balances to cover. Many of these people work in school, hospitals, and the stores that have provided essential services throughout the pandemic. People get payday loans to cover urgent expenses, and for many Americans, these loans are the only source of funding available during times of emergency or when financial needs exceed available funds.",
      "date": "02-03-2022"
    },
    {
      "id": 5,
      "thumbnail": "https://etzq49yfnmd.exactdn.com/wp-content/uploads/2022/03/claudia-van-zyl-L30rgHYSyuU-unsplash.jpg",
      "title": "The Places with the Best (and Worst) Nursing Homes in America",
      "content": "Last year in 2020 cast a harsh spotlight on nursing homes in America. As the coronavirus spread like wildfire within nursing homes across the nation, tens of thousands of their patients passed away from the disease. In one particularly shocking case in New Jersey, 17 dead bodies were found piled up in a nursing home.<br><br>The failure of many nursing homes to protect their inhabitants should cause our nation to pause and consider the quality of care in these institutions. Nursing homes are places for elderly Americans to live if they require skilled healthcare services and can no longer live independently. In the United States, Medicaid (a government healthcare program for lower income Americans) pays for nursing home care for 62% of patients.<br><br>With this backdrop in mind, DNPProgramStudies.com decided to analyze which places in America had the best and worst-rated nursing homes, as measured by their online reviews. Do some places in the country have homes with a reputation for great care while others have alarming reviews left about their conduct and facilities?<br><br>We found that Vermont has the highest-rated nursing homes on average, with a 4.42 score out of 5 stars, followed by Alaska and Hawaii. The state with the worst-rated nursing homes in the country is Nevada, followed by Georgia and Oregon.<br><br>Among larger cities, we found that Arlington Heights, IL has the best-rated nursing homes, followed by Salt Lake City, UT and Ocala, FL. Warren, MI is the city with the worst-rated nursing homes followed by Detroit, MI and Knoxville, TN.<br><br>Before diving into the results, let’s review the methodology and data used for the analysis. We analzyed online reviews on over 10,000 nursing homes across the country to see how they were rated. While most of the online reviews of nursing homes are written by the family members of inhabitants, they provide an important window into how these homes operate. For our analysis we only included nursing homes with at least 10 reviews. For our analysis of cities, we only looked at cities that had 250 or more reviews in aggregate.<br><br>Across the country, Vermont has the highest-rated nursing homes with a 4.42 average score. The state, with one of the highest rates of elderly population, leads the country with the best rating. Hawaii and New Hampshire also have a high rate of elderly population and are in the top 5 states with the highest ratings.<br><br>Nevada has the worst-rated nursing homes in the country, scoring in 3.16 star rating on average. The state also has some of the lowest-rated hospitals in the country and perennially ranks poorly on healthcare system rankings.<br><br>Arlington Heights, IL ranks as the top city in America with the best-rated nursing homes. This suburb of Chicago rates a 4.18 on average, beating out Salt Lake City, UT and Ocala, FL. Oakland, CA and Homestead, FL come in as the only other cities garnering an average score above four.<br><br>Warren, MI, a suburb of Detroit and the third largest city in the state, is the state with the worst-rated nursing homes in the country. Nursing home workers in both Warren and Detroit are currently planning a walk-out over low wages and poor working conditions. In Michigan, one third of all coronavirus deaths took place in nursing homes and some homes (including one in Warren) still lack COVID-19 testing facilities.<br><br>All too often, nursing homes and eldercare have taken a back seat in America. Even prior to the pandemic, the quality of care delivered by some of these institutions has been called into question. With nursing homes becoming ground zero of coronavirus deaths, we hope that this era is marked by reform that improves the quality of care for American senior citizens.<br><br>In this analysis, we’ve seen there is huge variation in the quality of nursing homes across America. The first step toward fixing something is measuring what is wrong and then acting upon that data.",
      "date": "11-02-2022"
    },
    {
      "id": 6,
      "thumbnail": "https://etzq49yfnmd.exactdn.com/wp-content/uploads/2022/03/marcus-kauffman-iretlQZEU4-unsplash.jpg",
      "title": "The Wildfire West: Where Housing Sprawl and Wildfire-Prone Areas Collide",
      "content": "As the world is still in the midst of a global pandemic, we are now entering fire season in the American West. After years of elevated global temperatures and drought, by the end of each summer, smoke-filled skies seem to be the norm across the West.<br><br>Though we would love a respite from calamity, there is no reason to believe that we’ll be spared from wildfires this year. With scientific certainty, we know which areas are prone to wildfires, though home construction continues in those areas.<br><br>At Cape Analytics, we use artificial intelligence to analyze vast quantities of geospatial imagery to help insurers and other companies better understand properties and property risk. Along with our partner HazardHub, we wanted to explore exactly how much sprawl there has been in the West’s high-risk fire zones. From the standpoint of insurance and danger to human life, these homes and adjacent communities are especially risky. Quantifying the risk can help homeowners and agencies such as CAL FIRE take more proactive and focused measures to protect lives and property.<br><br><b>The Hot Spots</b><br><br>To create this report, we analyzed new homes built over the last decade and found that California leads the West when it comes to the most builds in high-risk areas. Given that California is the most populous state in the country, we can expect a lot of new construction. When adjusting for population size, Utah leads the West by a significant margin in building homes in places with high fire risks.<br><br>When looking at specific cities with the most new home construction in high-risk zones in the West, El Dorado Hills, California tops the list, followed by St. George, Utah. In addition, as the pandemic has precipitated an urban exodus, many residents are fleeing into higher-risk fire zones.<br><br><b>Research Strategy</b><br><br>Before diving into the analysis, it’s worth spending a moment on the data and methodology. In this project, we identified new home construction over the last decade in Western states prone to wildfires. Specifically, we focused on areas in or near the Wildland Urban Interface — areas designated by the U.S. Forest Service, where human development and fire-prone wilderness meet. Our hazard data partner, HazardHub, then provided us with a wildfire risk score for each locality. This risk score takes weather, wildfire history, and many other factors into account. Finally, we narrowed down our analysis to new homes built in those high wildfire risk zones.<br><br>Over the last decade, California has built over 10,000 homes in areas deemed as high wildfire risk. High land prices and stringent zoning requirements in the California urban core have pushed builders further into rural areas, where the fire risk is much higher. Over the last few years, we have seen how dangerous wildfires can be in these areas of California, as places like Paradise and Santa Rosa have been devastated by fires. Among Western states, Utah ranks second in terms of high fire risk building, followed by Colorado.<br><br>However, it’s important to remember that California is the largest state in the United States by population and the third-largest by landmass. Given its size, we can expect more home construction in California compared to other states.<br><br>After adjusting for population size, it becomes clear that Utah has the most home building activity in high fire risk zones in the West. For every 100,000 citizens, 191.6 homes are built, a figure that is approximately 5x higher than Idaho, which ranks second in this metric. Utah, an arid state with large swathes of flammable vegetation, has actively developed a number of communities in high wildfire risk zones.<br><br>A similar dynamic is taking place in Utah, as large amounts of housing development are taking place in naturally beautiful, but highly combustible areas. For example, St. George, Utah, the second-ranked city in this analysis, is a mecca for retirees and vacationers near Zion National Park. The area, however, is filled with new developments plunked in the middle of high fire risk zones where water is brought in via pipeline from far away.<br><br>By looking at the increase in home building on a relative basis (comparing the number of new homes to the size of the city), we can bring smaller towns into focus. The chart below further demonstrates how Utah’s sprawl has accelerated over the last decade, with small towns like Stockton, Hurricane, and Santaquin expanding into high-risk areas. St. George again ranks high on this list as well.<br><br>Additional HazardHub analyses of these towns in Utah’s high desert paint a more detailed picture: St. George has been in a state of drought for 72 percent of the last 20 years, while Hurricane has been in drought for 68 percent of the previous 20 years. These bone-dry conditions are interspersed with short periods of rain, which allow scrub brush to grow…and then dry out again, creating excellent fuel for wildfires. These areas may not be ringed by dense forest, but they are still at very high risk of destructive fires driven by desert winds.<br><br><b>Insights and Mitigation Strategies</b><br><br>As a company that works with home insurers, each property’s fire risk is a metric we monitor over time. As this analysis shows, a tremendous number of new homes are being built in the highest wildfire risk areas. While they may be naturally beautiful, they are also naturally combustible. Our analysis suggests places like California and Utah contribute to rural sprawl and do so at considerable risk for more destruction of homes and loss of life wrought by wildfires. Moreover, as the climate gets hotter and drier, the risk in these areas will only grow, as stronger, wind-driven wildfires impact even some lower-risk regions.<br><br>What can residents do to protect themselves as wildfire risk increases in the coming decades? Luckily, some actions are proven to mitigate risk for individual properties.<br><br>One of the most effective deterrents is defensible space — a fancy word for clearing vegetation and flammable debris around your house. CAL FIRE, for example, recommends residents trim tree branches at least 10 feet away from buildings and other trees, and remove dead plants, branches, and shrubs up to 30 feet away from the structure. When implemented across entire neighborhoods, maintaining defensible space can insulate communities from the worst damage. For many of the areas named in this report, mitigation measures like these could be the difference between a neighborhood withstanding a wildfire and a community being destroyed.",
      "date": "10-14-2022"
    },
    {
      "id": 7,
      "thumbnail": "https://etzq49yfnmd.exactdn.com/wp-content/uploads/2022/03/michael-marsh-U0dBV_QeiYk-unsplash.jpg",
      "title": "How Much Money Do Communications Majors Make?",
      "content": "For those who are considering a career in communications, a key question to understand is how much money you’ll be making when you graduate. Furthermore, will that salary be sufficient to pay for the debt involved with getting your degree?<br><br>While predicting one’s future income is subject to uncertainty, especially in the current economic climate, there is luckily a lot of data out there. Along with Priceonomics customer MastersInCommunications.org, we analyzed and collected data by the US Department of Education about how much money communications majors earn.<br><br>Using data from the College Scorecard, a data resource about the earnings and debt of graduates of US colleges, we looked at which undergraduate communications programs produced the graduates with the best and worst financial prospects.<br><br>We found that communications majors from Georgia Tech and the University of Pennsylvania have the highest earnings while Shaw University has the lowest-earning graduates. Colleges like Devry and Grambling State University produce communications graduates with the highest debt while the City University of New York (CUNY) has graduated with the lowest levels of debt.<br><br>Before beginning the analysis of colleges where communications graduates earn the most and least, let’s look at the overall data. According to the most recent data from the US Department of Education College Scorecard, the median college graduate with a communications degree earns $31,400, approximately the same as the median US worker.<br><br>55.6% of graduates from college communications programs earn between $30K and $40K per year. In total, nearly 95% of communications majors earn under $40K per year. No undergraduate institution reported communications majors earning above $60K per year. Which colleges produce communications majors that earn the most and least?<br><br>Communications majors from Georgia Institute of Technology earn the most in the country with a median salary of $57,600 per year. In second place is the University of Pennsylvania, an Ivy League school where graduates earn just under $50,000 per year. In third place is the Mitchell Technical Institute, a technical college in South Dakota.<br><br>Communication graduates from Shaw University in Raleigh, North Carolina earn just $14,900 per year, the lowest in the country. SUNY Broome and Technical Career Institute graduates earn the second and third lowest salaries respectively.<br><br>Communications majors from Devry University emerge with $42,430 in debt, the highest in the country. Grambling State and Lane College communications majors also graduate with more than $40,000 in debt. On the other hand, a number of community colleges graduate communications majors with less than $10,000 in debt.<br><br>Some of the schools whose students graduate with debt also have the least favorable debt to income ratios. Grambling State University and Shaw University produce communications graduates with the highest debt to income ratios by a considerable margin. On the other hand, schools that produce graduates with low debt relative to their income are a mix of community colleges (CUNY), lower-priced private schools (Brigham Young), higher-priced private schools (Cornell), and state schools (University of California). For a communication major who looks to graduate with a strong income relative to debt, all types of schools may fit the bill.<br><br>In this analysis, we analyzed how much money communications majors earn after graduation and how that varies by school. The typical communications major earns about $31,400 though that number varies considerably by the school. At some schools like Georgia Tech and the University of Pennsylvania, graduates can earn substantially more than that amount. However, at many schools, communications will earn much less than average and come out with a mountain of debt. It’s important to carefully consider the meaning and debt data before choosing which school to attend.",
      "date": "09-16-2021"
    },
    {
      "id": 8,
      "thumbnail": "https://etzq49yfnmd.exactdn.com/wp-content/uploads/2022/03/luca-bravo-9l_326FISzk-unsplash.jpg",
      "title": "Bootcamp Satisfaction Statistics: What Jobs Can You Get After a Coding Bootcamp?",
      "content": "With university campuses closed across America and the fall quarter still uncertain, many current and prospective students are balking at the idea of paying $40,000 a year for what might simply end up being an online education. Students from established institutions like Stanford and Wharton have requested tuition refunds for Spring, and even if some colleges say they will open in August, it could all change by September.<br><br>Because of this disruption, some students are choosing to defer their higher education and are looking for an alternative that is both economical and able to get them into the workforce more quickly.<br><br>Coding bootcamps, which are intensive, accelerated programs that teach job-ready skills, offer an appealing option. These bootcamps are an effective, efficient, and affordable way to expand someone’s practical skills and career potential.<br><br>Coding bootcamps have strong success rates. According to a variety of surveys conducted over the past few years, both students and employers have favorable views of coding bootcamps. Indeed found that, “72% of employers think that bootcamp graduates are just as prepared and likely to be high performers as candidates with computer science degrees.” While bootcamps differ from a computer science degree, they are a lower-cost option that teaches foundational and practical skills that are in-demand in today’s job marketplace. Bootcamps also take less time than a traditional degree, which holds an appeal for many students.<br><br>To help prospective students make informed decisions about tech bootcamps and whether it’s the right choice for them, we analyzed our bootcamp review data1 to answer questions like “what kind of jobs are students getting after graduating from these coding bootcamps?” and “how do bootcamp alumni feel about their experience?”<br><br>On our site, we found:<br><br>The most common job title held by reviewers is “Software Developer,” which makes up 19.3% of all reviews.<br><br>The top 25 job titles reviewers hold after graduation are overwhelmingly technical and make up 64.7% percent of all reviews.<br><br>Most reviewers rated their bootcamp experience highly, although reviewers who noted they were “Unemployed” or found themselves in non-technical roles like “Marketing Manager” rated their experiences lower.<br><br>Below, we broke things down further to answer questions about satisfaction, what kind of jobs you can get after coding bootcamp, and what can make the bootcamp experience better.<br><br><b>How satisfied is the typical reviewer with their technology bootcamp?</b><br><br>The majority of people who attended coding bootcamps and left reviews are very satisfied with the experience. 86.9% of reviewers gave their bootcamp a 5-star review, and 96.2% percent of reviewers rated their programs either 4 or 5 stars.<br><br>The top job title held by bootcamp reviewers upon graduation is Software Developer, which makes up 19.3% of the reviews. The top 5 positions are each some variation of a developer, and combined, they comprise 41.8% of the reviews. Among reviewers, there is a high concentration among certain job titles; the top 25 positions make up 64.7% of all job titles among graduates.<br><br><b>Who is satisfied with their bootcamp education?</b><br><br>Graduates who have secured technical positions or become entrepreneurs report the highest satisfaction levels with their bootcamps. The most satisfied bootcamp reviewers are JavaScript Developers, which are followed closely by Senior Developers. Job titles associated with entrepreneurship such as Founder and CEO make up a small percentage of reviewers but also rate highly, as does the Freelance Developer Position.<br><br>Unsurprisingly, the least satisfied set of bootcamp reviewers are ones who were unemployed at the time of their review. While comprising just 0.3% of total reviews, they rate their experience 2.1 stars on average. Other job titles that report lower satisfaction with their bootcamp experience are Business Developer and Marketing Manager, which are both non-technical positions. However, they still rate at an average of 3.9 out of 5, which means they likely felt their bootcamp experience provided some value.<br><br><b>Taking a Closer Look at Bootcamp Satisfaction: What Made the Bootcamp Experience Better?</b><br><br>In addition to scoring their overall experience, bootcamp reviewers rated the bootcamp’s job support and curriculum. These factors influenced their bootcamp experience and whether it was satisfactory.<br><br>As part of their programs, bootcamps often offer mentorship, mock interviews, resume help, and more in order to increase graduates’ chances of landing a job. Graduates have gotten hired at notable companies such as Microsoft, Amazon, and Google.<br><br>Again, reviewers who have obtained technical or entrepreneurial positions upon graduation report the highest satisfaction with the career assistance provided by their bootcamps.<br><br>We also found a correlation between curriculum and satisfaction. Again, those who rated their bootcamp experience highly also felt positively about the curriculum. For example, JavaScript Developers were the most satisfied with their experiences overall and with their curriculum.<br><br>However, looking at the chart, bootcamp alumni rated the curriculum highly across the board. Most students rated their program’s curriculum an average of 4.6 stars or higher, except those who were unemployed or were marketing managers or designers.<br><br>Bootcamps pride themselves on having a comprehensive curriculum that teaches students in-demand skills. One student who took a Java course said, “Java technologies are such a wide environment that you can easily get lost by yourself…But CodingNomads has a great curriculum that gives you the essential technical skill to develop and deploy a Java project. Most valuable is you will have the ability to learn and master any technology you want by yourself!”<br><br>Another reviewer, who is now a data scientist, shared about Galvanize’s Data Science program, saying “The curriculum covered a great breadth of data science topics, but we still went into the depth of the math behind algorithms which I felt gave us good grounding on the justification of what we were learning. I also enjoyed the collaborative atmosphere of the daily assignments and group projects. Most importantly though, I really appreciated the career services they offered throughout the program, up to the final weeks, and even past graduation. I felt they really prepared me for navigating the job search and connecting with people.”<br><br><b>Bootcamps: Overall Impressions</b><br><br>Our data indicates that bootcamp graduates are satisfied with their experiences. Those most satisfied also felt the curriculum and job search support were beneficial. Reviewers who gave high ratings ended up in the tech field in jobs that resulted from the skills they learned in bootcamps.<br><br>Jobs you can get after a coding bootcamp include developer, associate engineer, data scientist, UX designer, project manager, and application developer. Other bootcamps can lead to jobs in digital marketing, cyber security, marketing, and web design. There is always the option to go freelance or become an entrepreneur.<br><br>Our conclusions also confirm how important it is to enroll in a bootcamp that meets your needs and build skills in the field you’re interested in. You can do this by asking yourself what your goals surrounding bootcamps are, and which type of bootcamp will be right for you.<br><br>A good way to select a coding bootcamp is by looking at what programming languages you want to learn based on the career you’re interested in. Some bootcamps will cover several programming languages, while others will have a more singular focus. Another thing to consider is whether curriculum offers career support, which may include how to search and apply for a job, write a resume, build a portfolio, or have interview practice.",
      "date": "07-22-23"
    },
    {
      "id": 9,
      "thumbnail": "https://etzq49yfnmd.exactdn.com/wp-content/uploads/2022/03/shawn-ang-nmpW_WwwVSc-unsplash.jpg",
      "title": "As the Economy Reopened, Job Applications Surged",
      "content": "The coronavirus outbreak and resulting shelter-in-place orders have created enormous changes in the hourly job market. Some industries, like hospitality, have seen unprecedented job losses. Other industries, like warehouse and logistics, have actually seen job growth as the delivery of goods becomes essential.<br><br>In this article, we’ll look at job applications. Are people looking for work currently or still shying away from employment due to the virus?<br><br>We found that in March and April, job applications for hourly jobs plummeted compared to February. However, this May, we’ve seen a very strong rebound. A lot of this rebound in May has been due to restaurants and healthcare facilities reopening. Nevertheless, most industries are seeing job applications below pre-pandemic levels.<br><br>While almost all metropolitan statistical areas have seen an increase in job applications, Miami, Las Vegas and Baltimore have seen the largest surge in applications this May.<br><br>In March and April we saw a steep decline in job applications, with job applications down 42% from their pre-pandemic level. However, this May has seen a sudden rebound in job applications as states have lifted stay-at-home restrictions. Applications are still well below pre-pandemic levels.<br><br>As the pandemic began, the number of applications per position fell in March and stayed similarly low in April. However by May, the number of applications per position available swung back to pre-pandemic levels.<br><br>Compared to February, hourly job postings are down 19%. Companies are hiring more in May than in April, but still at a much lower level than in February. On the national level, it appears as though both employers and potential employees are re-entering the labor market in May.<br><br>By a considerable margin, sit-down restaurants have seen the largest surge in applications in May compared to April. Because of the COVID-19 lockdown, most restaurants across the country were closed for sit-down dining in April. As these restaurants have reopened, job applications have returned. Grocery stores continue to attract applications, as they have continued hiring throughout the pandemic. Cleaning services have also rebounded during reopening, as have healthcare job applications as places like dentist offices are now allowed to operate.<br><br>This prior month, the metropolitan statistical areas (MSAs) of Miami, Las Vegas and Baltimore have seen the highest surge in job applications, followed by Houston and Orlando. Boston and Detroit have seen the smallest surge in job applicants, though both cities still received 13% more job applications than the prior month.<br><br>Just 13 of the top 50 largest metro areas on Snagajob are receiving more applications than prior to the pandemic’s start in February. Each of the top 6 locations are in the South, with Charleston and Greenville, South Carolina leading the way. Of all the metros we examined, Detroit has had the largest dropoff in applications with 46% fewer job applications in May compared to February.",
      "date": "07-15-23"
    },
    {
      "id": 10,
      "thumbnail": "https://etzq49yfnmd.exactdn.com/wp-content/uploads/2022/03/victor-he-9X9K7GJmVlk-unsplash.jpg",
      "title": "Hourly Job Market Update: Categories Where Jobs Are Growing (and Where They Are Gone)",
      "content": "The coronavirus outbreak has been an unprecedented shock to the hourly job market. The past few weeks have seen huge changes in who’s hiring.<br><br>Snagajob is the largest site for hourly jobs. And our employers include some of the hardest hit categories like sit-down restaurants. But we also help employers in the grocery and warehouse industries—and these jobs are critical to keeping the economy running during this crisis.<br><br>We’re here to let you know where there are job openings still available and what industries aren’t really hiring right now. This may sound like we’re stating the obvious, but we want to make sure you have all the information you need to make the right decisions for you and your family. <br><br>Overall,  job postings are down almost 40% from their peak a month ago. In particular, sit-down restaurants, staffing firms and entertainment have been the hardest hit. If you’re looking for a job, hiring is up in warehousing, logistics (think shipping) , retail, groceries and transportation. <br><br>You can see that jobs peaked on March 4th, before starting to drop, even before the WHO declared a worldwide pandemic on 3/11. From this peak, job postings have declined 41%. However, compared to the first day of this analysis (2/3/2020), jobs postings are only down 12.6% so far.<br><br>There is a  bright spot though! There’s a small uptick in job postings in the most recent dates. We’re seeing a complete reordering of the hourly job market, where some categories have disappeared for the time-being, but others are growing.<br><br>The world is completely different than before the pandemic, but it’s not all bad news when it comes to job postings. Logistics and warehouse job postings are up over 156% since the pandemic declaration. Retail, transportation and grocery job postings are also up. You can still find jobs in essential services that keep people fed and supplied.<br><br>There are still a lot of categories, however, that have seen a steep decline in job postings. Temporary staffing jobs have seen the largest drop, falling 74.1%. Entertainment, hospitality, on-demand and sit-down restaurant job postings have all fallen more than 30%.<br><br>Of the 122 largest metro areas on Snagajob, 113 of them have seen a decline in hourly jobs—just nine have seen an increase so far.  At the high end, places like Lafayette, Louisiana have seen a nearly 60% decrease in job postings for hourly workers. Of the top 10 most negatively affected cities, seven of them are in Louisiana or Utah. So far, Boston, San Francisco and Seattle have all seen an increase in job postings on Snagajob after the pandemic.<br><br>Warehouse and logistics jobs are up over 150% in just three weeks. Job postings for grocery stores and retail are also up as people still need to shop for essential items. While job postings may be down overall, the companies that are providing essential services to the country are still hiring.The hourly job market is still in flux and overall job postings are in decline. However, for those who are currently looking for jobs, some employers are hiring more than ever.",
      "date": "04-15-2023"
    }
  ]
}
